Mathew3000/FDL-3-ESP32/ArduinoOutput/sketch/FDL-3-ESP32.ino.cpp
#line 1 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\FDL-3-ESP32.ino"
#line 1 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\FDL-3-ESP32.ino"
#include <Arduino.h>
#include <analogWrite.h>
#include <ESP32PWM.h>
#include <ESP32Tone.h>
#include <SPI.h>
#include <Wire.h>
#include <Adafruit_SSD1306.h>
#include <Adafruit_GFX.h>
#include <EEPROM.h>
#include <ESP32Servo.h>
#include <ESP32Encoder.h>
#include <MicroViewWidget.h>





const byte versionNumber = 101;
const String splashText = "FDL-3 ESP32"; //can be two lines split with space

Servo flywheelESC; 
ESP32Encoder myEnc; 
MicroViewWidget *mainGauge;
MicroViewWidget *voltMeter;
//PARTY

// OLED DEF
#define OLED_DC     26
#define OLED_CS     25
#define OLED_MOSI   13
#define OLED_SCK    14
#define OLED_RESET  27
#define OLED_WIDTH  128
#define OLED_HEIGHT 64
#define OLED_HEADER 16
#define SMALL_T     1
#define LARGE_T     2
#define CH_SH       7
#define CH_LH       14
#define CH_SW       5
#define CH_LW       10
Adafruit_SSD1306 oled(OLED_WIDTH,OLED_HEIGHT, OLED_MOSI, OLED_SCK, OLED_DC, OLED_RESET, OLED_CS);

#define NOTHROTTLE 1000
#define MINTHROTTLE 1285
#define MAXTHROTTLE 2000

//PINS
#define pusherBrakePin 33
#define pusherEnablePin 32
#define escPin 34
#define buzzerPin 17
#define triggerPin 16
#define pusherSwitchPin 4
#define lockPin 5
#define voltMeterPin 2
#define presetBtnPin 34
#define encoderPin1 19
#define encoderPin2 18

//MENUS
const char *knobMenu[] = 
{
  "Speed",
  "ROF",
  "Burst", 
  "MinSpin",
  "MaxSpin",   
  "FireMode",
  "Spindown",
  "Idle",
  "Load",
  "Save",
  "MinSpd",
  "MaxSpd",
  "BtnMode",
  "BrkAg",
  "ULock",
  "Bright",
  "Sound",
  "BatOff",
  "Info"    
};
byte knobMenuIndex = 0;

const char *burstMenu[] = {"1","2","3","F"};
const char *soundMenu[] = {"OFF","ON"};
const char *presetMenu[] = {"Back","1","2","3"};
const char *btnmodeMenu[] = {"PRESET","SPEED","ROF","BURST"};
const char *firemodeMenu[] = {"SAFE","TRIG","AUTO","CACHE"};
byte presetMenuIndex = 0;

//variables
bool liveKnobScrollMode = false;
bool menuBtnWasDown = false;
bool firstMenuRun = true;
bool speedLocked = false;
bool firstRun = true;
unsigned long lastSpinCheck = 0;
unsigned long lastSettingsSave = 0;
unsigned long lastBatAlarm = 0;
unsigned long brakeRelease = 0;
unsigned long idleRelease = 0;
long encoderChange = 0;
int currentSpeed = NOTHROTTLE;
int spindownTarget = NOTHROTTLE;

#define batteryCheckLength 6
float batteryCheck[batteryCheckLength];
unsigned long lastBatteryCheck = 0;
int batteryCheckIndex = 0;
float batteryCheckSum = 0.0;

struct StaticSettings {
  byte btnMode;
  int brightness;
  byte soundOn;
  int batOffset;
  int brkAgr;
  int usrLock;
  int minSpeed;
  int maxSpeed;
};
StaticSettings currStSettings = { 3, 100, true, 0, 16, 0, 0, 100 };
StaticSettings lastStSettings = { 3, 100, true, 0, 16, 0, 0, 100 };
StaticSettings defStSettings = { 3, 100, true, 0, 16, 0, 0, 100 };

struct BlastSettings {
  int speedValue;
  int rofValue;
  byte burstCount;
  int minSpinup;
  int maxSpinup;
  int spinDown; //units per ms for single value drop (higher = slower)
  int idleTime;
  byte fireMode;  
};
BlastSettings currBlSettings = { 50, 100, 0, 220, 220, 14, 0, 1 };
BlastSettings lastBlSettings = { 50, 100, 0, 220, 220, 14, 0, 1 };
BlastSettings readBlSettings = { 50, 100, 0, 220, 220, 14, 0, 1 };
BlastSettings defBlSettings = { 50, 100, 0, 220, 220, 14, 0, 1 };

#line 143 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\FDL-3-ESP32.ino"
void setup();
#line 214 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\FDL-3-ESP32.ino"
void loop();
#line 27 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\CycleHelpers.ino"
void cycleShutdown();
#line 32 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\CycleHelpers.ino"
void shutdownFwAndPush();
#line 37 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\CycleHelpers.ino"
void spinDownFW(bool resetCheckTimer);
#line 58 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\CycleHelpers.ino"
bool checkCount();
#line 73 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\CycleHelpers.ino"
void triggerLogic(bool &triggerState, byte &shotsCached);
#line 93 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\CycleHelpers.ino"
bool enterFireLoop(byte shotsCached);
#line 112 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\CycleHelpers.ino"
bool enterAutoLoop(byte shotsCached);
#line 131 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\CycleHelpers.ino"
bool inFullAuto();
#line 135 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\CycleHelpers.ino"
boolean triggerDown();
#line 139 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\CycleHelpers.ino"
boolean lockOn();
#line 143 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\CycleHelpers.ino"
int presetButtonDown();
#line 164 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\CycleHelpers.ino"
int pusherSwitchDown();
#line 176 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\CycleHelpers.ino"
int readESCPower();
#line 180 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\CycleHelpers.ino"
void setFwSpeed(int newSpeed);
#line 184 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\CycleHelpers.ino"
int getSpinupByMotorSpeed();
#line 197 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\CycleHelpers.ino"
double doubleMap(double x, double in_min, double in_max, double out_min, double out_max);
#line 201 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\CycleHelpers.ino"
byte getBurstCount();
#line 211 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\CycleHelpers.ino"
int getROF();
#line 9 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\FireCycle.ino"
bool fireSequence();
#line 4 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\Presets.ino"
void loadSettings();
#line 22 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\Presets.ino"
void loadStaticSettings();
#line 27 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\Presets.ino"
void writeStaticSettings();
#line 34 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\Presets.ino"
bool staticSettingsChanged();
#line 46 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\Presets.ino"
void loadCurrentSettings();
#line 53 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\Presets.ino"
void writeCurrentSettings();
#line 74 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\Presets.ino"
bool currentSettingsChanged();
#line 86 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\Presets.ino"
void readPreset(byte presetIndex);
#line 91 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\Presets.ino"
void writePreset(byte presetIndex);
#line 100 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\Presets.ino"
void loadPreset(byte presetIndex);
#line 110 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\Presets.ino"
void writeDefaultSettings();
#line 2 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\RenderHelpers.ino"
void renderVoltMeter();
#line 58 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\RenderHelpers.ino"
void batteryWarning();
#line 64 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\RenderHelpers.ino"
void batteryCritical();
#line 74 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\RenderHelpers.ino"
void renderLockIndicator();
#line 84 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\RenderHelpers.ino"
void renderInfoMenu();
#line 100 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\RenderHelpers.ino"
void renderUserLock();
#line 208 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\RenderHelpers.ino"
void renderKnobScrollMenu();
#line 253 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\RenderHelpers.ino"
void renderMenu(byte &menuIndex, const char label[], const char* menu[], byte arraySize);
#line 299 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\RenderHelpers.ino"
void renderGauge(int &gaugeValue, String label, int gaugeMin, int gaugeMax, int valueMin, int valueMax, int detPerMove);
#line 333 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\RenderHelpers.ino"
void renderSplash(String splashText);
#line 411 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\RenderHelpers.ino"
void renderPresetMenu();
#line 463 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\RenderHelpers.ino"
void renderPreset(byte preset);
#line 4 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\Renderer.ino"
void renderScreen();
#line 129 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\Renderer.ino"
void presetButtonAction(int presButton);
#line 3 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\Utils.ino"
void toneAlt(int frequency, int duration);
#line 19 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\Utils.ino"
void initBatteryCheck();
#line 28 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\Utils.ino"
float getVoltLevel();
#line 55 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\Utils.ino"
void startUpBeeps();
#line 63 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\Utils.ino"
void clearSetRoutine();
#line 86 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\Utils.ino"
void clearLockRoutine();
#line 143 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\FDL-3-ESP32.ino"
void setup() {
  oled.begin();
  oled.clearDisplay();
  oled.display();
  oled.setTextSize(LARGE_T);   
  oled.setTextColor(SSD1306_WHITE); // Draw white text
  oled.setCursor(0, 0);     // Start at top-left corner
  oled.cp437(true);         // Use full 256 char 'Code Page 437' font

