Mathew3000/FDL-3-ESP32/ArduinoOutput/sketch/FDL-3-ESP32.ino.cpp
  // Init EEPROM
  EEPROM.begin(1024);

  // Setup Encoder
  myEnc.attachHalfQuad(encoderPin1, encoderPin2);

  // Setup ESC
  flywheelESC.attach(escPin); 
  flywheelESC.writeMicroseconds(0);  

  // Setup Pin Modes
  pinMode(voltMeterPin, INPUT);
  pinMode(presetBtnPin, INPUT);
  pinMode(pusherSwitchPin, INPUT);
  pinMode(triggerPin, INPUT_PULLUP);
  pinMode(lockPin, INPUT_PULLUP);
  pinMode(pusherEnablePin, OUTPUT);
  pinMode(pusherBrakePin, OUTPUT);
  pinMode(buzzerPin, OUTPUT);

  oled.clearDisplay();
  renderSplash(splashText);  
  loadSettings();
  
  if(presetButtonDown() == 4){
    int tmpLocVal = currStSettings.usrLock;
    clearSetRoutine();
    currStSettings.usrLock = tmpLocVal;
    writeStaticSettings();
  }
  
  if(lockOn() && presetButtonDown() == 3){
    clearLockRoutine();
  }

  //PARTY
  mainGauge = new MicroViewGauge(SSD1306_LCDWIDTH/2, OLED_HEADER + 24, 0, 100, WIDGETSTYLE1);
  voltMeter = new MicroViewSlider(56, 14, 106, 126, WIDGETSTYLE3);
  mainGauge->reDraw();
  voltMeter->reDraw();

  initBatteryCheck(); 

  if(currStSettings.usrLock != 0){
    renderUserLock();
  }
  else{
    flywheelESC.writeMicroseconds(NOTHROTTLE);
    
    renderScreen();
    startUpBeeps();
    
    if(lockOn()){
      delay(500);
      toneAlt(3000, 150);
      delay(150);
      toneAlt(3000, 150);
      speedLocked = true;
    }
  }
}

void loop() {
  
  if(currStSettings.usrLock != 0){
    renderUserLock();
    return;
  }

  //cap speed at max
  if(currBlSettings.speedValue > currStSettings.maxSpeed){
    currBlSettings.speedValue = currStSettings.maxSpeed;
  }
  
  //check for trigger
  if(triggerDown() && millis() > 2800){
    fireSequence();
  }
  else{
    if(millis() > brakeRelease){
      digitalWrite(pusherBrakePin, LOW); 
      delayMicroseconds(200);
    }
    if(millis() > idleRelease){
      spindownTarget = NOTHROTTLE; 
    }
  }
   
  spinDownFW(false);  
  renderScreen();

  if(lastSettingsSave != 0 && millis() - lastSettingsSave < 2000){
     //don't save
  }
  else{
    if(currentSettingsChanged() || staticSettingsChanged()){
      writeCurrentSettings();
      writeStaticSettings();
      lastSettingsSave = millis();      
    }
  }
}

#line 1 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\CycleHelpers.ino"
#define PSHFRNT 1
#define PSHREAR 2
#define PSHNONE 0

#define ANALOG_NONE 500
#define ANALOG_BT_1 4100
#define ANALOG_BT_2 3300
#define ANALOG_BT_3 2700
#define ANALOG_BT_ROT 2400

#define PRSTNONE 0
#define PRST1 1
#define PRST2 2
#define PRST3 3
#define PRSTROT 4

#define SAFETY 0
#define ABIDE 1
#define AUTO 2
#define CACHED 3

unsigned long logicLastCheck = 0;
unsigned long logicSwitchCheck = 0;
int clickCount = 0;
int hitCount = 0;

void cycleShutdown(){
  digitalWrite(pusherEnablePin, LOW);
  spinDownFW(true);
}

void shutdownFwAndPush(){
  digitalWrite(pusherEnablePin, LOW);
  setFwSpeed(NOTHROTTLE);
}

void spinDownFW(bool resetCheckTimer){
    if(resetCheckTimer){
      lastSpinCheck = 0;
    }
  
    if(currentSpeed > spindownTarget){
      if(currBlSettings.spinDown == 0){
        currentSpeed = spindownTarget;
      }
      else{
        unsigned long elapsedTime = lastSpinCheck == 0 ? 0 : millis() - lastSpinCheck;
        lastSpinCheck = millis();  
        int spindown = elapsedTime / currBlSettings.spinDown * 10;
        lastSpinCheck -= elapsedTime % currBlSettings.spinDown;        
        currentSpeed -= spindown;
        currentSpeed = max(spindownTarget, currentSpeed);
      }
    }
    setFwSpeed(currentSpeed);
}

bool checkCount(){  
  if(millis() - logicSwitchCheck > 1 && pusherSwitchDown() == PSHFRNT){
    logicSwitchCheck = millis();
    hitCount++;
  }

  if(hitCount > 3){    
    hitCount = 0;    
    return true;
  }
  else{
    return false;
  }
}

void triggerLogic(bool &triggerState, byte &shotsCached){  
  if(currBlSettings.fireMode == CACHED){ // in cache mode
      
    if(triggerState == false && triggerDown()){
      clickCount++;
    }
    if(triggerState == true && !triggerDown()){
      clickCount++;
    }

    if(clickCount > 50){
      clickCount = 0;
      triggerState = !triggerState;
      if(triggerState == true){
        shotsCached++;
      }
    }    
  }  
}

bool enterFireLoop(byte shotsCached){
  if(shotsCached > 0){  
    if(inFullAuto()){//full auto always abide by trigger except in auto mode for single shot
      return triggerDown() || (currBlSettings.fireMode != ABIDE && shotsCached >= 100);
    }  
    if(currBlSettings.fireMode == ABIDE){//trigger abide mode
      return triggerDown();
    }
    if(currBlSettings.fireMode == AUTO){//auto mode
      return true;
    }
    if(currBlSettings.fireMode == CACHED){//cached mode
      return true;
    }
  }
  
  return false;
}

bool enterAutoLoop(byte shotsCached){  
  if(shotsCached > 1){    
    if(inFullAuto()){//full auto always abide by trigger
      return triggerDown();
    }
    if(currBlSettings.fireMode == ABIDE){//trigger abide mode
      return triggerDown();
    }
    if(currBlSettings.fireMode == AUTO){//auto mode
      return true;
    }
    if(currBlSettings.fireMode == CACHED){//cached mode
      return true;
    }
  }
  
  return false;
}

bool inFullAuto(){
  return getBurstCount() == 100;
}

boolean triggerDown(){
  return digitalRead(triggerPin) == LOW;
}

boolean lockOn(){
  return digitalRead(lockPin) == LOW;
}

int presetButtonDown(){
  int readVal = analogRead(presetBtnPin);

  if(readVal < ANALOG_NONE){
    return PRSTNONE;
  }
  if(readVal < ANALOG_BT_ROT){
    return PRSTROT;
  }
  if(readVal < ANALOG_BT_3){
    return PRST3;
  }
  if(readVal < ANALOG_BT_2){
    return PRST2;
  }
  if(readVal < ANALOG_BT_1)
  {
    return PRST1;
  }
}

int pusherSwitchDown(){
  int readVal = analogRead(pusherSwitchPin);

  if(readVal < 400){
    return PSHNONE;
  }
  if(readVal < 900){
    return PSHFRNT;
  }
  return PSHREAR;
}

int readESCPower(){
  return map(currBlSettings.speedValue, 0, 100, MINTHROTTLE, MAXTHROTTLE);
}

void setFwSpeed(int newSpeed){
  flywheelESC.writeMicroseconds(newSpeed);
}

int getSpinupByMotorSpeed(){   
  double calcSpin = doubleMap(currBlSettings.speedValue, 0, 100, currBlSettings.minSpinup, currBlSettings.maxSpinup);
  if(currentSpeed < MINTHROTTLE){ return calcSpin; }
  if(currBlSettings.speedValue == 0){ return 0; }
  
  double minSync = 50;
  double targetThrottle = doubleMap(currBlSettings.speedValue, 0, 100, MINTHROTTLE, MAXTHROTTLE);  
  double throttleFactor =  (targetThrottle - currentSpeed) / (targetThrottle - MINTHROTTLE);
  calcSpin = calcSpin * throttleFactor - minSync;
  
  return max(0.0, calcSpin);
}

double doubleMap(double x, double in_min, double in_max, double out_min, double out_max) {
  return (x - in_min) * (out_max - out_min) / (in_max - in_min) + out_min;
}

byte getBurstCount(){
  byte arraySize = sizeof(burstMenu) / sizeof(size_t);
  if(currBlSettings.burstCount >= arraySize - 1){
    return 100;
  }
  else{
    return currBlSettings.burstCount + 1;
  }
}

int getROF(){
  return currBlSettings.rofValue;
}

#line 1 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\FireCycle.ino"
const int frontDownLoopDelay = 3; //delay till pass front switch if start from front rare case
const int frontDownLoopDur = 50; //wait delay till front switch up error if not met
const int frontUpLoopDur = 200; //wait delay to hit front switch error if not hit
const int frontPassDelay = 5; //pseudo debounce delay at front switch
const int rearUpLoopDur = 80; //first wait for rear switch
const int rearUpLoopDur2 = 200; //backup wait for rear switch
const int pusherBlipDur = 8; //pusher blip in attempts to reach back switch

bool fireSequence(){

    if(currBlSettings.fireMode == SAFETY){
      toneAlt(3000, 50);
      delay(100);
      toneAlt(2000, 100);
      return true;
    }
    
    //start wheels 
    int spinupDelay = getSpinupByMotorSpeed();
    currentSpeed = readESCPower();
    setFwSpeed(currentSpeed);
    
    unsigned long loopLastCheck = 0;

    //get cached shot count  
    byte cacheShots = getBurstCount();
    bool triggerState = true;
    
    //spinup
    loopLastCheck = millis();
    while(millis() - loopLastCheck < spinupDelay ){
      triggerLogic(triggerState, cacheShots);
    }

    //if in abide and trigger up, shutdown
    if(!triggerDown() && currBlSettings.fireMode == ABIDE){
      cycleShutdown();
      idleRelease = millis() + currBlSettings.idleTime * 1000;
      spindownTarget = MINTHROTTLE;      
      return true;
    }

