Mathew3000/FDL-3-ESP32/ArduinoOutput/sketch/FDL-3-ESP32.ino.cpp
    //shots cached
    while(enterFireLoop(cacheShots)){

      //disable brake
      digitalWrite(pusherBrakePin, LOW); 
      delayMicroseconds(200);

      digitalWrite(pusherEnablePin, HIGH);      
      
      //fire cycle begin
      //while front down / left at front, run
      //rare state
      loopLastCheck = millis();
      while(pusherSwitchDown() == PSHFRNT){
        if(millis() - loopLastCheck < frontDownLoopDur){          
          triggerLogic(triggerState, cacheShots);
          delay(frontDownLoopDelay);
        }
        else{
          break;
        }          
      }
      
      //run till front hit
      loopLastCheck = millis();
      logicSwitchCheck = millis();
      hitCount = 0;

      while(!checkCount()){
        if(millis() - loopLastCheck < frontUpLoopDur){
          triggerLogic(triggerState, cacheShots);
        }
        else{
          //front not reached in time, shutdown and beep
          cycleShutdown();
          toneAlt(2000, 100);
          return true;
        }
      }
      
      if(enterAutoLoop(cacheShots)){ //more than one shot remaining

        //short delay to get past front switch
        loopLastCheck = millis();
        while(millis() - loopLastCheck < frontPassDelay){ }
      
        //get delay between shots
        int burstBreakDelay = map(currBlSettings.rofValue, 0, 100, 100, 0);

        //blip brakes
        if(burstBreakDelay > 5){
            digitalWrite(pusherEnablePin, LOW);
            delayMicroseconds(200);
            digitalWrite(pusherBrakePin, HIGH);

            loopLastCheck = millis();
            while(millis() - loopLastCheck < burstBreakDelay){ }
            
            digitalWrite(pusherBrakePin, LOW);
            delayMicroseconds(200);
        }

        digitalWrite(pusherEnablePin, HIGH);
        cacheShots--;
      }
      else{ //final shot
        cacheShots--;
        break;        
      }      
    }

    //cycle finish
    //shut down pusher
    digitalWrite(pusherEnablePin, LOW);         
        
    //blip brakes and coast
    loopLastCheck = millis();        
    delayMicroseconds(200);      
    digitalWrite(pusherBrakePin, HIGH);
    while(pusherSwitchDown() != PSHREAR && millis() - loopLastCheck < currStSettings.brkAgr){ }
    digitalWrite(pusherBrakePin, LOW);            
    delayMicroseconds(200);    
    
    //while rear not down, coast till hit
    //blip if fail, attempt once to correct
    loopLastCheck = millis();    
    while(pusherSwitchDown() != PSHREAR){
      if(millis() - loopLastCheck < rearUpLoopDur){ }
      else{        
        //back not hit attempt pusher blip to get it there
        digitalWrite(pusherEnablePin, HIGH);
        delay(pusherBlipDur);
        digitalWrite(pusherEnablePin, LOW);  
        
        //while rear not down, coast till hit
        loopLastCheck = millis();
        while(pusherSwitchDown() != PSHREAR){
          if(millis() - loopLastCheck < rearUpLoopDur2){ }
          else{
            //rear not found, beep and shutdown cycle
            toneAlt(3000, 80);
            delay(80);
            toneAlt(3000, 80);
            cycleShutdown();
            return true;
          }
        }
      }
    }   

    //hard stop at rear
    delayMicroseconds(200);    
    digitalWrite(pusherBrakePin, HIGH);
    
    //set brake release for 200ms from now
    brakeRelease = millis() + 200;    
    spindownTarget = MINTHROTTLE;
    cycleShutdown();

    //spindown until trigger released
    while(triggerDown() && !inFullAuto()){ 
      spinDownFW(false);
    };

    idleRelease = millis() + currBlSettings.idleTime * 1000 + 100;
}

#line 1 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\Presets.ino"
byte offset = 0;
byte writes = 0;

void loadSettings(){
  byte readVersion = EEPROM.read(0);
  
  if(readVersion != versionNumber){
    //try again
    delay(200);
    readVersion = EEPROM.read(1);
    
    if(readVersion != versionNumber){    
      writeDefaultSettings();
    }
  }
  else{
    loadStaticSettings();
    loadCurrentSettings();
  }
}

void loadStaticSettings(){
  EEPROM.get(8, currStSettings);
  lastStSettings = currStSettings;
}

void writeStaticSettings(){
  if(!staticSettingsChanged()){ return; }
  
  EEPROM.put(8, currStSettings);
  lastStSettings = currStSettings;
}

bool staticSettingsChanged(){
  return (
    currStSettings.btnMode != lastStSettings.btnMode ||
    currStSettings.brightness != lastStSettings.brightness ||
    currStSettings.soundOn != lastStSettings.soundOn ||
    currStSettings.batOffset != lastStSettings.batOffset ||
    currStSettings.brkAgr != lastStSettings.brkAgr ||
    currStSettings.minSpeed != lastStSettings.minSpeed ||
    currStSettings.maxSpeed != lastStSettings.maxSpeed ||    
    currStSettings.usrLock != lastStSettings.usrLock );
}

void loadCurrentSettings(){
  offset = EEPROM.read(4);
  int settingsLoc = 102 + offset * 20;
  EEPROM.get(settingsLoc, currBlSettings);
  lastBlSettings = currBlSettings;
}

void writeCurrentSettings(){
  if(!currentSettingsChanged()){ return; }
  
  int writesLoc = 100 + offset * 20;
  EEPROM.get(writesLoc, writes);
  writes += 1;
  
  if(writes > 200){
    offset += 1;
    if(offset > 40){ offset = 0; }
    writesLoc = 100 + offset * 20;    
    writes = 0;
    EEPROM.put(4, offset);  
  }
  EEPROM.put(writesLoc, writes);
  
  int settingsLoc = 102 + offset * 20;
  EEPROM.put(settingsLoc, currBlSettings);
  lastBlSettings = currBlSettings;
}

bool currentSettingsChanged(){
  return (
    currBlSettings.speedValue != lastBlSettings.speedValue ||
    currBlSettings.rofValue != lastBlSettings.rofValue ||
    currBlSettings.burstCount != lastBlSettings.burstCount ||
    currBlSettings.minSpinup != lastBlSettings.minSpinup ||
    currBlSettings.maxSpinup != lastBlSettings.maxSpinup ||
    currBlSettings.fireMode != lastBlSettings.fireMode ||
    currBlSettings.spinDown != lastBlSettings.spinDown ||
    currBlSettings.idleTime != currBlSettings.idleTime);
}

void readPreset(byte presetIndex){
  int presetLoc = 24 + (presetIndex - 1) * 20;
  EEPROM.get(presetLoc, readBlSettings);
}

void writePreset(byte presetIndex){
  int presetLoc = 24 + (presetIndex - 1) * 20;
  EEPROM.put(presetLoc, currBlSettings); 
  
  toneAlt(2000, 50);
  delay(50);
  toneAlt(2000, 100);   
}

void loadPreset(byte presetIndex){
  int presetLoc = 24 + (presetIndex - 1) * 20;
  EEPROM.get(presetLoc, currBlSettings); 
  lastBlSettings = currBlSettings;

  toneAlt(4000, 50);
  delay(50);
  toneAlt(4000, 100);
}

