Mathew3000/FDL-3-ESP32/ArduinoOutput/sketch/FDL-3-ESP32.ino.cpp
void writeDefaultSettings(){  
  oled.clearDisplay();
  oled.setCursor(0,0);
  oled.print("Updating");
  oled.setCursor(0,14);
  oled.print("settings");
  oled.setCursor(0,28);
  float versionNum = (float)versionNumber / 100;
  oled.print(versionNum,2);
  oled.display();  
  
  //write defaults to all 
  EEPROM.put(0, versionNumber);
  EEPROM.put(1, versionNumber);
  offset = 0;
  EEPROM.put(4, offset);
  EEPROM.put(8, defStSettings);
  writes = 0;
  EEPROM.put(100, writes);
  EEPROM.put(102, defBlSettings); 
  EEPROM.put(24, defBlSettings);
  EEPROM.put(44, defBlSettings);
  EEPROM.put(64, defBlSettings); 
  currStSettings = defStSettings;
  lastStSettings = defStSettings;
  currBlSettings = defBlSettings;
  lastBlSettings = defBlSettings;  

  delay(1000);
  toneAlt(3000, 50);
  delay(50);
  toneAlt(2500, 100);
  delay(50);
  toneAlt(2000, 200);
  delay(100);
  
  oled.clearDisplay();
  oled.display();
}

#line 1 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\RenderHelpers.ino"

void renderVoltMeter(){  
  if(firstMenuRun){
    voltMeter->reDraw();
  }

  float voltLevel = getVoltLevel();
  voltLevel = 11.0;
  voltMeter->setValue(voltLevel * 10);

  if(speedLocked){
    renderLockIndicator();
  }
  else{
    oled.setCursor(41,0);
    if(voltLevel < 10){
      oled.print("0");
    }
    oled.print(voltLevel,1);    
  }
   
  if(voltLevel < 10.8){
    if(lastBatAlarm + 3000 < millis()){
      shutdownFwAndPush();
      batteryWarning();
      lastBatAlarm = millis();
    }
  }

  if(voltLevel < 10.7){
    if(lastBatAlarm + 1500 < millis()){
      shutdownFwAndPush();
      batteryWarning();
      lastBatAlarm = millis();
    }
  }
  
  if(voltLevel < 10.6){
    if(lastBatAlarm + 1000 < millis()){
      shutdownFwAndPush();
      batteryCritical();
      lastBatAlarm = millis();
    }
  }

  if(voltLevel < 10.5){
    while(true){
      shutdownFwAndPush();
      batteryCritical();
      delay(200);
    }
  }
  
  oled.setCursor(56,39);
  oled.print("B");    
}

void batteryWarning(){
  toneAlt(2400, 140);
  toneAlt(4000, 140);
  toneAlt(1200, 200);
}

void batteryCritical(){
  toneAlt(2400, 140);
  delay(100);
  toneAlt(4000, 140);
  delay(100);
  toneAlt(2400, 140);
  delay(100);
  toneAlt(4000, 140);
}

void renderLockIndicator(){
  int xLoc = 34;
  if(currStSettings.maxSpeed < 100){ xLoc = 40; }
  if(currStSettings.maxSpeed < 10){ xLoc = 46; }  
  oled.setCursor(xLoc,0);
  oled.print("SL");
  oled.print(currStSettings.maxSpeed);
  oled.setTextSize(SMALL_T);
}

void renderInfoMenu(){  
  oled.setTextSize(LARGE_T);
  oled.setCursor(0,OLED_HEADER);
  oled.print("Info");
  oled.setCursor(0,OLED_HEADER + (CH_LH + 2) * 1);
  oled.print("FDL-3");
  oled.setCursor(0,OLED_HEADER + (CH_LH + 2) * 2);
  oled.print("v");
  float versionNum = (float)versionNumber / 100;
  oled.print(versionNum,2);  
  oled.print("A");
  oled.display();
  firstMenuRun = false;
  oled.setTextSize(SMALL_T);    
}

void renderUserLock(){

  while(presetButtonDown() == PRSTROT){}
  
  oled.clearDisplay();
  oled.setTextSize(LARGE_T);  
  oled.setCursor(0,0);
  oled.print("User Lock");
  
  if(currStSettings.usrLock == 0){
    oled.setCursor(0,OLED_HEADER);
    oled.print("Set");
  }
  else{
    oled.setCursor(0,OLED_HEADER);
    oled.print("Enter");
  }
  oled.print(" Code");
  oled.display();

  if(currStSettings.usrLock == 0){
    toneAlt(2400, 80);
    toneAlt(1600, 80);
    toneAlt(2400, 140);
  }
  else{
    toneAlt(1600, 140);
    toneAlt(1200, 140);
    delay(200);
  }
  
  int usrLock = 0;
  
  for(int i = 0; i < 3; i++){
    int prstBut = 0;
    while(prstBut == 0){ prstBut = presetButtonDown(); }
    while(presetButtonDown() != 0) { };
    toneAlt(2400, 120);    
    if(prstBut == 4){ break; }

    if(i > 0 && i < 3){ usrLock *= 10; }
    usrLock += prstBut;

    if(usrLock > 0){
      oled.setCursor(0,OLED_HEADER + CH_LH + 4);  
      oled.print(usrLock);
      oled.display();
    }
  }
  delay(300);
  
  usrLock = usrLock < 100 ? 0 : usrLock;

  if(usrLock > 100){ //code fully entered
    if(currStSettings.usrLock == 0){
      currStSettings.usrLock = usrLock;
      writeStaticSettings();

      oled.clearDisplay();
      oled.setCursor(6,18);
      oled.print("Code Set");
      oled.setCursor(0,36);
      oled.print(currStSettings.usrLock);
      oled.display();      
      
      toneAlt(1600, 80);
      delay(50);
      toneAlt(2400, 140);
      delay(300);
    }
    else{
      if(currStSettings.usrLock == usrLock){
        currStSettings.usrLock = 0;
        writeStaticSettings();

        oled.clearDisplay();
        oled.setCursor(8,16);
        oled.print("Unlocked");
        oled.display();        
        
        toneAlt(2400, 80);
        delay(30);
        toneAlt(2400, 80);
        delay(30);
        toneAlt(3000, 80);
        delay(100);

        knobMenuIndex = 0;
        liveKnobScrollMode = false;
        firstMenuRun = true;
      }
    }
  }
  else{
    if(currStSettings.usrLock == 0){
      liveKnobScrollMode = true;      
    }
    toneAlt(1600, 80);
    delay(200);
  }

  oled.clearDisplay();
  oled.display();  
}

/////////////////
//main menu
/////////////////
void renderKnobScrollMenu(){
  encoderChange += myEnc.getCount();
  myEnc.setCount(0);

  byte arraySize = sizeof(knobMenu) / sizeof(size_t);
  if(abs(encoderChange) >= 8){
    if(!(knobMenuIndex == 0 && encoderChange < 0)){
      knobMenuIndex += encoderChange / 8;
      knobMenuIndex = constrain(knobMenuIndex, 0, arraySize - 1);
    }
    encoderChange = 0;    
    toneAlt(2000,10);
  }

  oled.setCursor(0,0);
  oled.setTextSize(LARGE_T);
  oled.print("Mode");

  int textLength = 0;
  const char* testPtr = knobMenu[knobMenuIndex];
  while(*(testPtr++) != '\0'){
    textLength++;
  }

  int txtWidth = CH_LW * (textLength + 1);
  int txtHeight = CH_LH;
  int txtLocX = constrain((OLED_WIDTH - txtWidth) / 2 - 1, 0, OLED_WIDTH / 2);
  int txtLocY = constrain((OLED_HEIGHT - txtHeight) / 2 - 1, 0, OLED_HEIGHT / 2);
  oled.fillRect(0, OLED_HEADER, OLED_WIDTH, OLED_HEIGHT - OLED_HEADER, BLACK);
  
