Mathew3000/FDL-3-ESP32/ArduinoOutput/sketch/FDL-3-ESP32.ino.cpp
  oled.setCursor(txtLocX,txtLocY);
  testPtr = knobMenu[knobMenuIndex];
  while(*testPtr != '\0'){
    oled.print(*testPtr);
    testPtr++;
  }
  
  oled.display();
  firstMenuRun = false;
  oled.setTextSize(SMALL_T);    
}

/////////////////
//menu type settings
/////////////////
void renderMenu(byte &menuIndex, const char label[], const char* menu[], byte arraySize){
  encoderChange += myEnc.getCount();
  myEnc.setCount(0);

  if(abs(encoderChange) >= 4){
    if(!(menuIndex == 0 && encoderChange < 0)){
      menuIndex += encoderChange / 4;
      menuIndex = constrain(menuIndex, 0, arraySize - 1);
    }
    encoderChange = 0;
  }

  oled.setTextSize(LARGE_T); 
  oled.setCursor(0,0);
  oled.print(label);

      

  int textLength = 0;
  const char* testPtr = menu[menuIndex];
  while(*(testPtr++) != '\0'){
    textLength++;
  }

  int txtWidth = CH_LW * (textLength + 1);
  int txtHeight = CH_LH;
  int txtLocX = constrain((OLED_WIDTH - txtWidth) / 2 - 1, 0, OLED_WIDTH / 2);
  int txtLocY = constrain((OLED_HEIGHT - txtHeight) / 2 - 1, 0, OLED_HEIGHT / 2);

  oled.fillRect(0, txtLocY, OLED_WIDTH, txtLocY + txtHeight, BLACK);  
  oled.setCursor(txtLocX, txtLocY);
  testPtr = menu[menuIndex];
  while(*testPtr != '\0'){
    oled.print(*testPtr);
    testPtr++;
  } 
  
  oled.display();
  firstMenuRun = false;
  oled.setTextSize(SMALL_T);    
}


/////////////////
//gauge type settings
/////////////////
void renderGauge(int &gaugeValue, String label, int gaugeMin, int gaugeMax, int valueMin, int valueMax, int detPerMove){
  mainGauge->setMinValue(gaugeMin);
  mainGauge->setMaxValue(gaugeMax);
  
  if(firstMenuRun){
    mainGauge->reDraw();
    firstMenuRun = false;
  }

  oled.setCursor(0,0);
  oled.setTextSize(LARGE_T);
  oled.print(label);
  oled.setTextSize(SMALL_T);
    
  encoderChange += myEnc.getCount();
  myEnc.setCount(0);

  if(abs(encoderChange) >= detPerMove || firstMenuRun){
    gaugeValue += encoderChange / detPerMove;
    gaugeValue = constrain(gaugeValue, valueMin, valueMax);
    encoderChange = 0;
  }
  // Deactivated Extra Delay
  /*oled.setCursor(OLED_WIDTH / 2 - 1.5 * CH_LW, OLED_HEIGHT - CH_LH);
  oled.fillRect(0, OLED_HEIGHT - CH_LH, OLED_WIDTH, CH_LH, BLACK);    
  oled.print(gaugeValue);
  if(gaugeValue < 10){ oled.print(" "); }
  if(gaugeValue < 100){ oled.print(" "); }*/

  mainGauge->setValue(gaugeValue);
  oled.display();
}


void renderSplash(String splashText){

  oled.setTextSize(LARGE_T);

  int spaceIndex = splashText.indexOf(' ');

  if(spaceIndex == -1){
    int txtWidth = CH_LW * (splashText.length() + 1) ;
    int txtLocX = constrain((OLED_WIDTH - txtWidth) / 2, 0, OLED_WIDTH / 2);
    int txtLocY = constrain((OLED_HEIGHT - CH_LH) / 2, 0, OLED_HEIGHT / 2);
  
    oled.setCursor(txtLocX,txtLocY);
  
    for(int i = 0; i < splashText.length(); i++){
      oled.print(splashText[i]);
      oled.display();
      delay(50);
    }
  }
  else{
    String sub1 = splashText.substring(0, spaceIndex);
    String sub2 = splashText.substring(spaceIndex + 1);

    int charWidth = CH_LW;
    int charHeight = CH_LH;

    if(sub1.length() * CH_LW > OLED_WIDTH){
      oled.setTextSize(SMALL_T);
      charWidth = CH_SW;
      charHeight = CH_SH;
    }
    else{
      oled.setTextSize(LARGE_T);
    }
    
    int txtWidth1 = charWidth * (sub1.length() + 1);        
    int txtLocX1 = constrain((OLED_WIDTH - txtWidth1) / 2, 0, OLED_WIDTH / 2);    
    int txtLocY1 = constrain((OLED_HEIGHT - charHeight) / 2, 0, OLED_HEIGHT / 2);
    txtLocY1 -= (charHeight/2 + 1);

    oled.setCursor(txtLocX1,txtLocY1);
  
    for(int i = 0; i < sub1.length(); i++){
      oled.print(sub1[i]);
      oled.display();
      delay(50);
    }
    charWidth = 5;
    if(sub2.length() * CH_LW > OLED_WIDTH){
      oled.setTextSize(SMALL_T);
      charWidth = CH_SW;
      charHeight = CH_SH;
    }
    else{
      oled.setTextSize(LARGE_T);
      charWidth = CH_LW;
      charHeight = CH_LH;
    }

    int txtWidth2 = charWidth * (sub2.length()+1);
    int txtLocX2 = constrain((OLED_WIDTH - txtWidth2) / 2, 0, OLED_WIDTH / 2);    
    int txtLocY2 = constrain((OLED_HEIGHT - charHeight) / 2, 0, OLED_HEIGHT / 2);
    txtLocY2 += charHeight/2 + 1;

    oled.setCursor(txtLocX2,txtLocY2);
  
    for(int i = 0; i < sub2.length(); i++){
      oled.print(sub2[i]);
      oled.display();
      delay(50);
    }
  }

  delay(600);  
  oled.clearDisplay();
  oled.display();  
}

void renderPresetMenu(){
  
  encoderChange += myEnc.getCount();
  myEnc.setCount(0);

  byte arraySize = sizeof(presetMenu) / sizeof(size_t);
  if(abs(encoderChange) >= 4){
    if(!(presetMenuIndex == 0 && encoderChange < 0)){
      presetMenuIndex += encoderChange / 4;
      presetMenuIndex = constrain(presetMenuIndex, 0, arraySize - 1);
    }
    encoderChange = 0;
  }

  oled.clearDisplay();
  if(presetMenuIndex > 0){
    renderPreset(presetMenuIndex);
  }
  else{
    firstMenuRun = true;
    if(speedLocked){ renderLockIndicator(); }  
    renderVoltMeter();
    
    oled.setCursor(0,OLED_HEADER);
    oled.print("Load");

    oled.setTextSize(LARGE_T);   
    
    int textLength = 0;
    const char* testPtr = presetMenu[presetMenuIndex];
    while(*(testPtr++) != '\0'){
      textLength++;
    }
    int txtWidth = CH_LW * (textLength + 1);
    int txtHeight = CH_LH;
    int txtLocX = constrain((OLED_WIDTH - txtWidth) / 2 - 1, 0, OLED_WIDTH / 2);
  
    oled.rectFill(0, 26, 55, 26 + txtHeight, BLACK, NORM);
    
    oled.setCursor(txtLocX, OLED_HEADER);    
    testPtr = presetMenu[presetMenuIndex];
    while(*testPtr != '\0'){
      oled.print(*testPtr);
      testPtr++;
    } 
  }
  
  oled.display();
  firstMenuRun = false;
  oled.setTextSize(SMALL_T);    
}

void renderPreset(byte preset){
  readPreset(preset);

  oled.clearDisplay();
  oled.setTextSize(SMALL_T);      
  oled.setCursor(0,OLED_HEADER);
  oled.print(firemodeMenu[readBlSettings.fireMode]);  
  oled.setCursor(0,OLED_HEADER + (CH_SH + 3) * 1);
  oled.print("S:");
  oled.print(readBlSettings.speedValue);  
  oled.setCursor(0,OLED_HEADER + (CH_SH + 3) * 2);
  oled.print("B:");
  oled.print(burstMenu[readBlSettings.burstCount]);  
  oled.setCursor(0,OLED_HEADER + (CH_SH + 3) * 3);
  oled.print("R:");
  oled.print(readBlSettings.rofValue);  

  oled.setCursor(OLED_WIDTH / 2,OLED_HEADER);
  oled.print("p:");
  oled.print(readBlSettings.minSpinup);
  oled.setCursor(OLED_WIDTH / 2,OLED_HEADER + (CH_SH + 3) * 1);
  oled.print("P:");
  oled.print(readBlSettings.maxSpinup);
  oled.setCursor(OLED_WIDTH / 2,OLED_HEADER + (CH_SH + 3) * 2);
  oled.print("D:");
  oled.print(readBlSettings.spinDown);
  oled.setCursor(OLED_WIDTH / 2,OLED_HEADER + (CH_SH + 3) * 3);
  oled.print("I:");
  oled.print(readBlSettings.idleTime);

  oled.rectFill(57, 39, 8, 9, WHITE , NORM);
  oled.setColor(BLACK);
  oled.setCursor(0,0);
  oled.setTextSize(LARGE_T);
  oled.print("Preset: ");
  oled.print(preset);
}

