Mathew3000/FDL-3-ESP32/ArduinoOutput/sketch/FDL-3-ESP32.ino.cpp
#line 1 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\Renderer.ino"
/////////////
///RENDER////
/////////////
void renderScreen(){

  // PARTY
  //renderVoltMeter();

  if(liveKnobScrollMode){
    renderKnobScrollMenu();
  }
  
  else{
    switch(knobMenuIndex){
      case 0:
        renderGauge(currBlSettings.speedValue, "Speed", 0, 100, currStSettings.minSpeed, currStSettings.maxSpeed, 1);
        break;
      case 1:
        renderGauge(currBlSettings.rofValue, "ROF", 0, 100, 0, 100, 1);
        break;
      case 2:
        renderMenu(currBlSettings.burstCount, "Burst", burstMenu, sizeof(burstMenu) / sizeof(size_t));
        break;
      case 3:
        renderGauge(currBlSettings.minSpinup, "MinSpn", 150, 500, 150, 500, 1);
        break;
      case 4:
        renderGauge(currBlSettings.maxSpinup, "MaxSpn", 150, 500, 150, 500, 1);
        break;
      case 5:
        renderMenu(currBlSettings.fireMode, "FireMode", firemodeMenu, sizeof(firemodeMenu) / sizeof(size_t));
        break;  
      case 6:
        renderGauge(currBlSettings.spinDown, "SpnDwn", 6, 25, 6, 25, 8);
        break;
      case 7:
        renderGauge(currBlSettings.idleTime, "Idle", 0, 10, 0, 10, 8);
        break;    
      case 8:
        renderPresetMenu();
        break;
      case 9:
        renderMenu(presetMenuIndex, "Save", presetMenu, sizeof(presetMenu) / sizeof(size_t));
        break;
      case 10:
        renderGauge(currStSettings.minSpeed, "MinSpd", 0, 100, 0, currStSettings.maxSpeed, 1);
        break;
      case 11:
        if(!speedLocked){
          renderGauge(currStSettings.maxSpeed, "MaxSpd", 0, 100, currStSettings.minSpeed, 100, 1);
        }
        break; 
      case 12:
        renderMenu(currStSettings.btnMode, "Btn Mode", btnmodeMenu, sizeof(btnmodeMenu) / sizeof(size_t));
        break;
      case 13:
        renderGauge(currStSettings.brkAgr, "BrkAgr", 3, 25, 3, 25, 8);
        break;
      case 14:
        renderUserLock();
        break;
      case 15:
        renderGauge(currStSettings.brightness, "Bright", 0, 100, 0, 100, 1);
        break;
      case 16:
        renderMenu(currStSettings.soundOn, "Sound", soundMenu, sizeof(soundMenu) / sizeof(size_t));
        break;
      case 17:
        renderGauge(currStSettings.batOffset, "BatOff", -8, 8, -8, 8, 8);
        break;
      case 18:
        renderInfoMenu();
        break;      
      default:
        break;
    }
  }  
  
  //look for rot switch or preset press
  int presetButton = presetButtonDown();

  if(presetButton != PRSTNONE){
    if(presetButtonDown() == PRSTROT){ //rot button down
      if(!menuBtnWasDown){
                        
        if(liveKnobScrollMode){ //in main menu
          presetMenuIndex = 0;
        }
        else{ //in submenu
          if(knobMenu[knobMenuIndex] == "Load" && presetMenuIndex > 0){
            loadPreset(presetMenuIndex); 
          }
          if(knobMenu[knobMenuIndex] == "Save"  && presetMenuIndex > 0){
            writePreset(presetMenuIndex); 
          }
        }

        liveKnobScrollMode = !liveKnobScrollMode; //flip between main menu and setting
  
        if(speedLocked && knobMenu[knobMenuIndex] == "MaxSpd"){ //ignore flip if locked
          liveKnobScrollMode = true;
        }
        
        oled.clearDisplay();
        firstMenuRun = true;
        myEnc.setCount(0);
      }
      menuBtnWasDown = true;
    }
    else{ //preset button pressed   
      if(!menuBtnWasDown){ 
        toneAlt(1500, 10);
        delay(160);
        if(presetButtonDown() == presetButton){
          presetButtonAction(presetButton);
          menuBtnWasDown = true;
          oled.clearDisplay();
          firstMenuRun = true;
          myEnc.setCount(0);
        }
      }      
    }    
  }
  else{
    menuBtnWasDown = false;
  } 
}

void presetButtonAction(int presButton){
  if(currStSettings.btnMode == 0){//preset
    loadPreset(presButton);
  }
  if(currStSettings.btnMode == 1){//speed
    int valueCoef = 30;
    currBlSettings.speedValue = 100 - (presButton * valueCoef - valueCoef);
    toneAlt(2000, 100);
  }
  if(currStSettings.btnMode == 2){//rof
    int valueCoef = 25;
    currBlSettings.rofValue = 100 - (presButton * valueCoef - valueCoef);
    toneAlt(2000, 100);
  }
  if(currStSettings.btnMode == 3){//burst
    if(presButton == 3){
      currBlSettings.burstCount = 3;
    }
    else{
      currBlSettings.burstCount = presButton - 1;
    }
    toneAlt(2000, 100);
  }
}

#line 1 "c:\\Users\\matthias.naumann\\Documents\\FDL-3-ESP32\\Utils.ino"

//roll custom tone generator to avoid conflict with Timer2 and abstract pin
void toneAlt(int frequency, int duration){

  if(!currStSettings.soundOn){ return; }
  
  int freqDelay = 1000000 / frequency / 2;
  int loopCount = duration * 1000 / (freqDelay * 2);

  unsigned long offTime = millis() + duration;
  while(millis() < offTime){
    digitalWrite(buzzerPin, HIGH); 
    delayMicroseconds(freqDelay); 
    digitalWrite(buzzerPin, LOW); 
    delayMicroseconds(freqDelay);
  }
}

void initBatteryCheck(){
  //init battery average read values
  for(int x = 0; x < batteryCheckLength; x++){
    batteryCheck[x] = 12.0;
  }
  lastBatteryCheck = millis();
  batteryCheckSum = 12.0 * batteryCheckLength;
}

float getVoltLevel(){
  
 if(millis() > lastBatteryCheck + 300){ //check every 300ms
    const float vPow = 5.042;;
    const float r1 = 100000;
    const float r2 = 10000;

    float v = (analogRead(voltMeterPin) * vPow) / 1024.0;
    float v2 = v / (r2 / (r1 + r2));

    v2 *= 10;
    int v2Int = (int)v2;
    v2 = (float)v2Int / 10;

    batteryCheckSum -= batteryCheck[batteryCheckIndex];
    batteryCheck[batteryCheckIndex] = v2;
    batteryCheckSum += v2;
    batteryCheckIndex++;
    if(batteryCheckIndex >= batteryCheckLength){
      batteryCheckIndex = 0;
    }
    lastBatteryCheck = millis();    
  }
  
  return batteryCheckSum / batteryCheckLength + (float)currStSettings.batOffset / 10.0;
}

void startUpBeeps(){
  toneAlt(2000, 60);
  delay(60);
  toneAlt(2000, 60);
  delay(60);
  toneAlt(2000, 60);
}

void clearSetRoutine(){
  while(presetButtonDown() == 4){};
  delay(50);
  
  oled.setCursor(0,0);
  oled.print("Click knob");
  oled.setCursor(0,14);
  oled.print("to clear");
  oled.setCursor(0,28);
  oled.print("settings");
  oled.display();

  long currMills = millis();
  while(millis() < currMills + 2000){
    if(presetButtonDown() == 4){
      writeDefaultSettings();
      break;
    }
  }
  oled.clearDisplay();
  oled.display();
}

void clearLockRoutine(){
  while(lockOn() && presetButtonDown() == 3){ delay(50); };
  if(presetButtonDown() != 3){ return; }
  while(presetButtonDown() == 3){ delay(50); };
  while(presetButtonDown() == 0){ delay(50); };
  if(presetButtonDown() != 2){ return; }

  currStSettings.usrLock = 0;
  writeStaticSettings();

  oled.clearDisplay();  
  oled.setCursor(10,16);
  oled.print("Unlocked");
  oled.display();        
  
  toneAlt(2400, 80);
  delay(30);
  toneAlt(2400, 80);
  delay(30);
  toneAlt(3000, 80);
  delay(100);

  oled.clearDisplay(); 
  oled.display(); 
}

